//создание массива и передача числа, вопросов, вариантов и ответов
let questions = [
    {
        numb: 1,
        question: "Что такое комментарии в Python и для чего они используются?",
        answer: "Все ответы верны",
        options: [
            "Это фрагменты кода, которые игнорируются интерпретатором",
            "Это текст, который не обрабатывается компилятором",
            "Это текст, который будет виден только при редактировании кода",
            "Все ответы верны"
        ]
    },
    {
        numb: 2,
        question: "Какой символ используется при создания комментарии в Python?",
        answer: "#",
        options: [
            "*",
            "//",
            "()",
            "#"
        ]
    },
    {
        numb: 3,
        question: "Можно ли использовать комментарии для отключения определенного участка кода?",
        answer: "Да",
        options: [
            "Да",
            "Нет",
            "Всегда можно",
            "Исключения есть"
        ]
    },
    {
        numb: 4,
        question: "Какой символ используется при создания многострочные комментарии в Python?",
        answer: "(''' ''')",
        options: [
            "(''' ''')",
            "/* */",
            "()",
            "#"
        ]
    },
    {
        numb: 5,
        question: "Можно ли вложить комментарий внутрь строки кода?",
        answer: "Нет",
        options: [
            "Да",
            "Исключения есть",
            "Нет",
            "Всегда можно"
        ]
    },
];